Revit 2027 API
ExtendedPropertiesLinkData.AddValues Method
 Adds the provided parameter values to the Revit Element identified by %elementId%.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AddValues(
	LinkElementId elementId,
	ExtendedPropertiesLinkValues values
)
Public Function AddValues (
	elementId As LinkElementId,
	values As ExtendedPropertiesLinkValues
) As Boolean
public:
bool AddValues(
	LinkElementId^ elementId,
	ExtendedPropertiesLinkValues^ values
)
member AddValues :
        elementId : LinkElementId *
        values : ExtendedPropertiesLinkValues -> bool
Parameters
elementId LinkElementId
 The identifier of the Element to add the parameter values.
values ExtendedPropertiesLinkValues
 The values to be added.
Return Value
Boolean
 True if all of the values were added, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExtendedPropertiesLinkData Class
Autodesk.Revit.DB.ExternalData Namespace